package bytedance;

/**
 * @Description:
 * @Author: MegaFrenzy
 * @CreateTime: 2020-09-14 下午
 *
 * 三面80min
 * 1.自我介绍和项目部分
 *      因为自己项目和投递岗位不算很相关,所以面试官不好展开问
 * 2.算法部分
 *      找不到原题，考察有向无环图的拓扑排序，想了很久还是不会
 *      最后基本在面试官提示下写完的.....用的dfs
 *
 *      第二个算法题是设计一个LRU缓存，说出思路
 *      除了key-value，还有一个ttl时间
 *      完成put，get操作如何设计，并说出对应的时间复杂度
 *
 *      堆排序思路以及构建堆的时间复杂度(O(n))
 * 3.问答部分
 *      你都知道那些设计模式？拿出来讲讲，设计模式有看过书吗? (head first设计模式)
 *      LEFT JOIN 和RIGHT JOIN的区别
 *      可能还有别的问题但是记不得了...
 * 4.反问部分
 *      你觉得我前面哪些问题回答的不够好？(你自己先总结总结....)
 *
 * HR面
 *      自我介绍优缺点
 *      面试是怎么准备的
 *      能不能来实习
 *      有什么要问我的吗
 */
public class Interview2_3 {
}
